[
    {"text": "Стремитесь не к успеху, а к ценностям, которые он дает.",
        "author": "Альберт Эйнштейн"},
    {"text": "Сложнее всего начать действовать, все остальное зависит только от упорства.",
        "author": "Амелия Эрхарт"},
    {"text": "Надо любить жизнь больше, чем смысл жизни.",
        "author": "Федор Достоевский"},
    {"text": "Жизнь - это то, что с тобой происходит, пока ты строишь планы.",
        "author": "Джон Леннон"},
    {"text": "Ваше время ограничено, не тратьте его, живя чужой жизнью.",
        "author": "Стив Джобс"},
    {"text": "В моем словаре нет слова «невозможно».",
        "author": "Наполеон Бонапарт"},
    {"text": "Вы никогда не пересечете океан, если не наберетесь мужества потерять берег из виду.",
        "author": "Христофор Колумб"},
    {"text": "Если вы думаете, что на что-то способны, вы правы; если думаете, что у вас ничего не получится - вы тоже правы.",
        "author": "Генри Форд"},
    {"text": "Начинайте делать все, что вы можете сделать – и даже то, о чем можете хотя бы мечтать. В смелости гений, сила и магия.",
        "author": "Иоганн Вольфганг Гете"},
    {"text": "Стоит только поверить, что вы можете – и вы уже на полпути к цели.",
        "author": "Теодор Рузвельт"},
    {"text": "Счастье – это не нечто готовое. Счастье зависит только от ваших действий.",
        "author": "Далай Лама"},
    {"text": "Если внутренний голос говорит вам, что вы не можете рисовать – рисуйте как можно больше, тогда этот голос затихнет.",
        "author": "Винсент Ван Гог"},
    {"text": "Никогда не делает ошибок только тот, кто не пробует ничего нового.",
        "author": "Альберт Эйнштейн"},
    {"text": "Быстрее всего учишься в трех случаях — до 7 лет, на тренингах, и когда жизнь загнала тебя в угол.",
        "author": "Стивен Кови"},
    {"text": "Всегда выбирайте самый трудный путь - на нем вы не встретите конкурентов.",
        "author": "Шарль де Голль"},
    {"text": "Единственное счастье в жизни — это постоянное стремление вперед.",
        "author": "Эмиль Золя"},
    {"text": "Перед тем как карабкаться на лестницу успеха, убедитесь, что она прислонена к стене того здания, что вам нужно.",
        "author": "Стивен Кови"},
    {"text": "Велики те, кто видит, что миром правят мысли.",
        "author": "Ральф Эмерсон"},
    {"text": "Единственный способ сделать что-то очень хорошо – любить то, что ты делаешь.",
        "author": "Стив Джобс"},
    {"text": "Жизнь меряется не тем, сколько в ней лет, а тем, сколько в этих годах настоящей жизни.",
        "author": "Авраам Линкольн"}
    ]