[
    {"text": "Strive not for success, but for the values ​​that it gives.",
        "author": "Albert Einstein"},
    {"text": "The hardest thing is to start acting, everything else depends only on perseverance.",
        "author": "Amelia Earhart"},
    {"text": "One must love life more than the meaning of life.",
        "author": "Fedor Dostoevsky"},
    {"text": "Life is what happens to you while you are making plans.",
        "author": "John Lennon"},
    {"text": "Your time is limited, don't waste it living someone else's life.",
        "author": "Steve Jobs"},
    {"text": "I don't have the word impossible in my dictionary.",
        "author": "Napoleon Bonaparte"},
    {"text": "You will never cross the ocean unless you have the courage to lose sight of the shore.",
        "author": "Christopher Columbus"},
    {"text": "If you think you are capable of something, you are right; If you think that you will not succeed, you are also right.",
        "author": "Henry Ford"},
    {"text": "Start doing everything you can do - and even what you can even dream of. In courage, genius, strength and magic.",
        "author": "Johann Wolfgang Goethe"},
    {"text": "You just have to believe that you can - and you are already halfway to the goal.",
        "author": "Theodore Roosevelt"},
    {"text": "Happiness is not something ready made. Happiness depends only on your actions.",
        "author": "Dalai Lama"},
    {"text": "If an inner voice tells you that you cannot draw - draw as much as possible, then this voice will subside.",
        "author": "Vincent van Gogh"},
    {"text": "Only those who never try new things never make mistakes.",
        "author": "Albert Einstein"},
    {"text": "You learn the fastest in three cases - up to 7 years, at trainings, and when life has driven you into a corner.",
        "author": "Stephen Covey"},
    {"text": "Always choose the most difficult path - on it you will not meet competitors.",
        "author": "Charles de Gaulle"},
    {"text": "The only happiness in life is the constant striving forward.",
        "author": "Emile Zola"},
    {"text": "Before climbing the ladder of success, make sure it is leaning against the wall of the building you need.",
        "author": "Stephen Covey"},
    {"text": "Great are those who see that thoughts rule the world.",
        "author": "Ralph Emerson"},
    {"text": "The only way to do something very well is to love what you do.",
        "author": "Steve Jobs"},
    {"text": "Life is measured not by how many years it has, but by how many years of real life there are.",
        "author": "Abraham Lincoln"}
    ]