console.log("САМООЦЕНКА: 110 баллов \n \n");

console.log("--------------------------------");

console.log("1. Вёрстка валидная (+10) \n \n");

console.log("2. Вёрстка семантическая (+20) \n \n");

console.log("В коде странице присутствуют следующие элементы (указано минимальное количество, может быть больше):");

console.log("  2.1 <header>, <main>, <footer> (+3)");

console.log("  2.2 четыре элемента <section> (по количеству секций) (+3)");

console.log("  2.3 только один заголовок <h1> (+3)");

console.log("  2.4 три заголовка <h2> (+3)");

console.log("  2.5 один элемент <nav> (панель навигации) (+3)");

console.log("  2.6 два списка ul > li > a (панель навигации, ссылки на соцсети) (+3)");

console.log("  2.7 четыре кнопки <button> (+2) \n \n");

console.log("3. Вёрстка соответствует макету (+48) : \n \n");

console.log("  3.1 блок <header> (+6)");

console.log("  3.2 секция preview (+9)");

console.log("  3.3 секция steps (+9)");

console.log("  3.4 секция destinations (+9)");

console.log("  3.5 секция stories (+9)");

console.log("  3.6 блок <footer> (+6) \n \n");

console.log("4. Требования к css (+ 12) : \n \n");

console.log("  4.1 для построения сетки используются флексы или гриды (+2)");

console.log("  4.2 при уменьшении масштаба страницы браузера вёрстка размещается по центру, а не сдвигается в сторону (+2)");

console.log("  4.3 фоновый цвет тянется на всю ширину страницы (+2). Поставила 2 балла, т.к. фон картинки тянется на ширину макета 1440 px, исходя из самого макета. На всякий случай указала фон для тега body, что тоже приравнивается этой фразе 'тянется на всю ширину страницы'");

console.log("  4.4 иконки добавлены в формате .svg. (+2)");

console.log("  4.5 изображения добавлены в формате .jpg (+2)");

console.log("  4.6 есть favicon (+2) \n \n");

console.log("5. Интерактивность, реализуемая через css (+20) : \n \n");

console.log("  5.1 плавная прокрутка по якорям (+5)");

console.log("  5.2 ссылки в футере ведут на гитхаб автора проекта и на страницу курса https://rs.school/js-stage0/ (+5)");

console.log("  5.3 интерактивность (изменение фона кнопок, цвета ссылок в навигации, цвета ссылки readMore, фона иконок в footer) (+5)");

console.log("  5.4 обязательное требование к интерактивности: плавное изменение (+5)");


