console.log("САМООЦЕНКА: 127 баллов из 150 \n \n");

console.log("--------------------------------");
console.log("СДЕЛАНО:");

console.log("1. Часы и календарь (+15) \n \n");

console.log("2. Приветствие (+10) \n \n");

console.log("3. Смена фонового изображения (+20) \n \n");

console.log("4. Виджет погоды (+15) \n \n");

console.log("5. Виджет цитата дня (+10) \n \n");

console.log("6. Аудиоплеер (+15) \n \n");

console.log("7. Продвинутый аудиоплеер (реализуется без использования библиотек) (+20) \n \n");

console.log("8.5. переводятся настройки приложения. При переключении языка приложения в настройках, язык настроек тоже меняется (+3) \n \n");

console.log("10.1. в настройках приложения можно указать язык приложения (en/ru или en/be) (+3) \n \n");

console.log("10.4. в настройках приложения можно скрыть/отобразить любой из блоков, которые находятся на странице: время, дата, приветствие, цитата дня, прогноз погоды, аудиоплеер, список дел/список ссылок/ваш собственный дополнительный функционал (+3) \n \n");

console.log("10.5. скрытие и отображение блоков происходит плавно, не влияя на другие элементы, которые находятся на странице, или плавно смещая их (+3) \n \n");

console.log("10.6. настройки приложения сохраняются при перезагрузке страницы (+5) \n \n");


console.log("\n \n--------------------------------");
console.log("СДЕЛАНО НЕ ПОЛНОСТЬЮ:");

console.log("11. ToDo List - список дел (как в оригинальном приложении) (+5) \n \n");

console.log("\n \n--------------------------------");
console.log("НЕ СДЕЛАНО:");

console.log("8.1. переводится язык и меняется формат отображения даты \n \n");

console.log("8.2. переводится приветствие и placeholder \n \n");

console.log("8.3. переводится прогноз погоды в т.ч описание погоды (OpenWeatherMap API предоставляет такую возможность) и город по умолчанию \n \n");

console.log("8.4. переводится цитата дня (используйте подходящий для этой цели API, возвращающий цитаты на нужном языке или создайте с этой целью JSON-файл с цитатами на двух языках) r \n \n");

console.log("9. Получение фонового изображения от API  \n \n");

console.log("10.2. Получение фонового изображения от API  \n \n");

console.log("10.3. если источником получения фото указан API, в настройках приложения можно указать тег/теги, для которых API будет присылает фото  \n \n");






